# Chapter 7. Working with Numbers

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 7.1 Computing an Average

In [2]:
%%sql
select round(avg(sal), 2) as avg_sal
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(Decimal('2073.21'),)]

In [3]:
%%sql
select deptno,
       round(avg(sal), 2) as avg_sal
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, Decimal('2916.67')), (20, Decimal('2175.00')), (30, Decimal('1566.67'))]

In [4]:
%%sql
select deptno,
       round(avg(coalesce(comm, 0)), 2) as avg_comm
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, Decimal('0.00')), (20, Decimal('0.00')), (30, Decimal('366.67'))]

## 7.2 Finding the Min/Max Value in a Column

In [5]:
%%sql
select min(sal) as min_sal,
       max(sal) as max_sal
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(800, 5000)]

In [6]:
%%sql
select deptno,
       min(sal) as min_sal,
       max(sal) as max_sal
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, 1300, 5000), (20, 800, 3000), (30, 950, 2850)]

## 7.3 Summing the Values in a Column

In [7]:
%%sql
select sum(sal) as sum_sal
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(29025,)]

In [8]:
%%sql
select deptno,
       sum(sal) as sum_sal
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, 8750), (20, 10875), (30, 9400)]

## 7.4 Counting Rows in a Table

In [9]:
%%sql
select count(1)
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(14,)]

In [10]:
%%sql
select count(*)    as count,
       count(sal)  as count_sal,
       count(mgr)  as count_mgr,
       count(comm) as count_comm
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(14, 14, 13, 4)]

In [11]:
%%sql
select deptno,
       count(*) as count
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, 3), (20, 5), (30, 6)]

## 7.5 Counting Values in a Column

In [12]:
%%sql
with data as (
    select null as x
    from generate_series(1, 1000)
)
select count(*)                                  as count,
       count(x)                                  as count_x,
       count(case when random() < .5 then 1 end) as count_random
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(1000, 0, 488)]

## 7.6 Generating a Running Total

In [13]:
%%sql
select ename,
       sal,
       sum(sal) over (order by sal)        as running_total_sal,
       sum(sal) over (order by sal, ename) as running_total_sal_ename
from emp
order by sal;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, 800, 800),
 ('JAMES', 950, 1750, 1750),
 ('ADAMS', 1100, 2850, 2850),
 ('MARTIN', 1250, 5350, 4100),
 ('WARD', 1250, 5350, 5350),
 ('MILLER', 1300, 6650, 6650),
 ('TURNER', 1500, 8150, 8150),
 ('ALLEN', 1600, 9750, 9750),
 ('CLARK', 2450, 12200, 12200),
 ('BLAKE', 2850, 15050, 15050),
 ('JONES', 2975, 18025, 18025),
 ('FORD', 3000, 24025, 21025),
 ('SCOTT', 3000, 24025, 24025),
 ('KING', 5000, 29025, 29025)]

## 7.7 Generating a Running Product

In [14]:
%%sql
select ename,
       sal,
       exp(sum(ln(sal)) over (order by sal, empno))::bigint as running_prod
from emp
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[('MILLER', 1300, 1300), ('CLARK', 2450, 3185000), ('KING', 5000, 15925000000)]

## 7.8 Smoothing a Series of Values
### Low level

In [15]:
%%sql
with data as (
    select *
    from (values ('2020-01-01', 647),
                 ('2020-01-02', 561),
                 ('2020-01-03', 741),
                 ('2020-01-04', 978),
                 ('2020-01-05', 1062),
                 ('2020-01-06', 1072),
                 ('2020-01-07', 805),
                 ('2020-01-08', 662),
                 ('2020-01-09', 1083),
                 ('2020-01-10', 970))
             as t(date1, sales)
)
select date1,
       sales,
       (sales + lag(sales, 1) over (order by date1) + lag(sales, 2) over (order by date1)) / 3 as moving_avg
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
10 rows affected.

[('2020-01-01', 647, None),
 ('2020-01-02', 561, None),
 ('2020-01-03', 741, 649),
 ('2020-01-04', 978, 760),
 ('2020-01-05', 1062, 927),
 ('2020-01-06', 1072, 1037),
 ('2020-01-07', 805, 979),
 ('2020-01-08', 662, 846),
 ('2020-01-09', 1083, 850),
 ('2020-01-10', 970, 905)]

### High level

In [16]:
%%sql
with data as (
    select *
    from (values ('2020-01-01', 647),
                 ('2020-01-02', 561),
                 ('2020-01-03', 741),
                 ('2020-01-04', 978),
                 ('2020-01-05', 1062),
                 ('2020-01-06', 1072),
                 ('2020-01-07', 805),
                 ('2020-01-08', 662),
                 ('2020-01-09', 1083),
                 ('2020-01-10', 970))
             as t(date1, sales)
)
select date1,
       sales,
       avg(sales) over (order by date1 rows between 2 preceding and current row)::integer as moving_avg
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
10 rows affected.

[('2020-01-01', 647, 647),
 ('2020-01-02', 561, 604),
 ('2020-01-03', 741, 650),
 ('2020-01-04', 978, 760),
 ('2020-01-05', 1062, 927),
 ('2020-01-06', 1072, 1037),
 ('2020-01-07', 805, 980),
 ('2020-01-08', 662, 846),
 ('2020-01-09', 1083, 850),
 ('2020-01-10', 970, 905)]

In [17]:
import altair as alt
import pandas as pd
import psycopg2

try:
    con = psycopg2.connect(
        "postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook"
    )
    df = pd.concat(
        [
            pd.read_sql_query(
                """
                with data as (
                    select *
                    from (values ('2020-01-01', 647),
                                 ('2020-01-02', 561),
                                 ('2020-01-03', 741),
                                 ('2020-01-04', 978),
                                 ('2020-01-05', 1062),
                                 ('2020-01-06', 1072),
                                 ('2020-01-07', 805),
                                 ('2020-01-08', 662),
                                 ('2020-01-09', 1083),
                                 ('2020-01-10', 970))
                             as t(date1, sales)
                )
                select date1,
                       sales,
                       (sales + lag(sales, 1) over (order by date1) + lag(sales, 2) over (order by date1)) / 3 as moving_avg
                from data;
                """,
                con,
            ).assign(method="Low level"),
            pd.read_sql_query(
                """
                with data as (
                    select *
                    from (values ('2020-01-01', 647),
                                 ('2020-01-02', 561),
                                 ('2020-01-03', 741),
                                 ('2020-01-04', 978),
                                 ('2020-01-05', 1062),
                                 ('2020-01-06', 1072),
                                 ('2020-01-07', 805),
                                 ('2020-01-08', 662),
                                 ('2020-01-09', 1083),
                                 ('2020-01-10', 970))
                             as t(date1, sales)
                )
                select date1,
                       sales,
                       avg(sales) over (order by date1 rows between 2 preceding and current row)::integer as moving_avg
                from data;
                """,
                con,
            ).assign(method="High Level"),
        ],
        ignore_index=True,
    )
    display(
        alt.Chart(df.melt(["date1", "method"]), width=400, height=200)
        .mark_line(point=True)
        .encode(
            x="date1",
            y=alt.Y("value", scale=alt.Scale(zero=False)),
            color="variable",
            column=alt.Column("method", sort=["Low level", "High level"]),
        )
    )
finally:
    con.close()

alt.Chart(...)

## 7.9 Calculating a Mode

In [18]:
%%sql
select mode() within group (order by sal) as modal_sal
from emp
where deptno = 20;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(3000,)]

## 7.10 Calculating a Median

In [19]:
%%sql
select percentile_cont(.5) within group (order by sal) as median_sal
from emp
where deptno = 20;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(2975.0,)]

## 7.11 Determining the Percentage of a Total

In [20]:
%%sql
select round(100. * sum(case deptno when 10 then sal end) / sum(sal), 2) as percent_share
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(Decimal('30.15'),)]

## 7.12 Aggregating Nullable Columns

In [21]:
%%sql
select round(avg(comm), 2)              as avg_comm,
       round(avg(coalesce(comm, 0)), 2) as avg_coalesce_comm
from emp
where deptno = 30;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(Decimal('550.00'), Decimal('366.67'))]

## 7.13 Computing Averages Without High and Low Values

In [22]:
%%sql
select round(avg(sal), 2)                                            as mean,
       round((sum(sal) - min(sal) - max(sal)) / (count(sal) - 2), 2) as trimmed_mean
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(Decimal('2073.21'), Decimal('1935.00'))]

## 7.14 Converting Alphanumeric Strings into Numbers

In [23]:
%%sql
with data as (
    select 'paul123f321' as string
)
select regexp_replace(string, '\D', '', 'g')::int as number
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(123321,)]

## 7.15 Changing Values in a Running Total

In [24]:
%%sql
with v as (
    select *
    from (values (1, 100, 'PR'),
                 (2, 100, 'PR'),
                 (3, 50, 'PY'),
                 (4, 100, 'PR'),
                 (5, 200, 'PY'),
                 (6, 50, 'PY'))
             as t(id, amt, trx)
)
select case trx
           when 'PR' then 'PURCHASE'
           when 'PY' then 'PAYMENT'
           end                          as trx_type,
       amt,
       sum(case trx
               when 'PR' then amt
               when 'PY' then -amt
           end) over (order by id, amt) as balance
from v;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[('PURCHASE', 100, 100),
 ('PURCHASE', 100, 200),
 ('PAYMENT', 50, 150),
 ('PURCHASE', 100, 250),
 ('PAYMENT', 200, 50),
 ('PAYMENT', 50, 0)]

## 7.16 Finding Outliers Using the Median Absolute Deviation

In [25]:
%%sql
with
    median as (
        select percentile_cont(.5) within group (order by sal) as median
        from emp
    ),
    ad as (
        select abs(sal - median) as ad
        from emp, median
    ),
    mad as (
        select percentile_cont(.5) within group (order by ad) as mad
        from emp, ad
    )
select ename,
       job,
       sal,
       round((abs(sal - mad) / mad)::numeric, 2) as sigma
from emp, mad;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('SMITH', 'CLERK', 800, Decimal('0.19')),
 ('ALLEN', 'SALESMAN', 1600, Decimal('1.37')),
 ('WARD', 'SALESMAN', 1250, Decimal('0.85')),
 ('JONES', 'MANAGER', 2975, Decimal('3.41')),
 ('MARTIN', 'SALESMAN', 1250, Decimal('0.85')),
 ('BLAKE', 'MANAGER', 2850, Decimal('3.22')),
 ('CLARK', 'MANAGER', 2450, Decimal('2.63')),
 ('SCOTT', 'ANALYST', 3000, Decimal('3.44')),
 ('KING', 'PRESIDENT', 5000, Decimal('6.41')),
 ('TURNER', 'SALESMAN', 1500, Decimal('1.22')),
 ('ADAMS', 'CLERK', 1100, Decimal('0.63')),
 ('JAMES', 'CLERK', 950, Decimal('0.41')),
 ('FORD', 'ANALYST', 3000, Decimal('3.44')),
 ('MILLER', 'CLERK', 1300, Decimal('0.93'))]

## 7.17 Finding Anomalies Using Benford’s Law

In [26]:
%%sql
with
    expected as (
        select digit,
               log10(1 + 1 / digit) as frequency
        from generate_series(1., 9) as digit
    ),
    actual as (
        select distinct digit,
                        1. * count(*) over (partition by digit) / count(*) over () as frequency
        from (select sal::char::int as digit
              from emp) _
    )
select digit,
       expected.frequency                               as expected_frequency,
       actual.frequency                                 as actual_frequency,
       abs(expected.frequency - actual.frequency) > .05 as anomaly
from actual join expected using (digit)
order by digit;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[(Decimal('1'), Decimal('0.30102999566398119521'), Decimal('0.42857142857142857143'), True),
 (Decimal('2'), Decimal('0.17609125905568124208'), Decimal('0.21428571428571428571'), False),
 (Decimal('3'), Decimal('0.12493873660829995313'), Decimal('0.14285714285714285714'), False),
 (Decimal('5'), Decimal('0.07918124604762482772'), Decimal('0.07142857142857142857'), False),
 (Decimal('8'), Decimal('0.05115252244738128895'), Decimal('0.07142857142857142857'), False),
 (Decimal('9'), Decimal('0.04575749056067512541'), Decimal('0.07142857142857142857'), False)]